thingotron/ArduinoCore-atsamd21e18a/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This package for the Atmel SAM D21E/R21E was derrived from the
# Arduino Zero board package, and made by A. Albino <aalbino@femtoduino.com>
# Please note, it includes my modified version of Atmel's samr21 header/source files 
# to fix some bugs in the original implementation of USB and CMSIS headers
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA



# Orbotron 9001 (ATSAMD21E18A)
orbotron9001.name=Orbotron 9001
orbotron9001.vid.0=0x1d50
orbotron9001.pid.0=0x6067

orbotron9001.upload.tool=arduino:bossac
orbotron9001.upload.protocol=sam-ba
orbotron9001.upload.maximum_size=262144
orbotron9001.upload.use_1200bps_touch=true
orbotron9001.upload.wait_for_upload_port=true
orbotron9001.upload.native_usb=true
orbotron9001.build.mcu=cortex-m0plus
orbotron9001.build.f_cpu=48000000L
orbotron9001.build.usb_product="Orbotron 9001"
orbotron9001.build.usb_manufacturer="Thingotron Labs"
orbotron9001.build.board=SAMD_ZERO
orbotron9001.build.core=arduino_osc32k
orbotron9001.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
orbotron9001.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
orbotron9001.build.openocdscript=openocd_scripts/atsamd21e18a.cfg
orbotron9001.build.variant=atsamd21e18a
orbotron9001.build.variant_system_lib=
orbotron9001.build.vid=0x1d50
orbotron9001.build.pid=0x6067
orbotron9001.bootloader.tool=openocd
orbotron9001.bootloader.file=zero_osc32k/orbotron_2_bootloader.bin

# Orbotron 9001 (via atmel ICE)
# ---------------------------------------
orbotron9001_ice.name=Orbotron 9001 (via atmel ICE)
orbotron9001_ice.vid.0=0x1d50
orbotron9001_ice.pid.0=0x6067

orbotron9001_ice.upload.tool=arduino:openocd
orbotron9001_ice.upload.protocol=sam-ba
orbotron9001_ice.upload.maximum_size=262144
orbotron9001_ice.upload.use_1200bps_touch=false
orbotron9001_ice.upload.wait_for_upload_port=false
orbotron9001_ice.upload.native_usb=false
orbotron9001_ice.build.mcu=cortex-m0plus
orbotron9001_ice.build.f_cpu=48000000L
orbotron9001_ice.build.usb_product="Orbotron 9001"
orbotron9001_ice.build.usb_manufacturer="Thingotron Labs"
atsamr21e18a_ice.build.board=SAMD_ZERO
orbotron9001_ice.build.core=arduino_osc32k
orbotron9001_ice.build.extra_flags=-D__SAMR21E18A__ {build.usb_flags}
orbotron9001_ice.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
orbotron9001_ice.build.openocdscript=openocd_scripts/atsamr21e18a.cfg
orbotron9001_ice.build.variant=atsamr21e18a
orbotron9001_ice.build.variant_system_lib=
orbotron9001_ice.build.vid=0x1d50
orbotron9001_ice.build.pid=0x6067
orbotron9001_ice.bootloader.tool=openocd
orbotron9001_ice.bootloader.file=zero_osc32k/orbotron_2_bootloader.bin
